package HT;

import java.util.Locale;
import java.util.Scanner;
//Написати консольну програму для роботи з Enums.
//        Створити енум Сезони, в якому оголосити такі константи : Зима , Весна, Літо, Осінь.
//        Створити енум Місяці, в якому створити 12 констант- місяці року(Січень , Лютий.. Грудень ), оголосити змінну дні,
//        та змінну сезон типу Сезон , як поле енума . Створити конструктор з визначеними параметрами в енумі Місяці, в
//        який як параметри передати змінну дні та сезон. Описати getters до даних полів (дні, сезони). Створити
//        консольне меню, в якому реалізувати наступні пункти :
//        ● Перевірити чи є такий місяць (місяць вводимо з консолі, передбачити, щоб регістр
//        ● букв був не важливим ).
//        ● Вивести всі місяці з такою ж порою року.
//        ● Вивести всі місяці які мають таку саму кількість днів.
//        ● Вивести на екран всі місяці які мають меншу кількість днів.
//        ● Вивести на екран всі місяці які мають більшу кількість днів.
//        ● Вивести на екран наступну пору року.
//        ● Вивести на екран попередню пору року.
//        ● Вивести на екран всі місяці які мають парну кількість днів.
//        ● Вивести на екран всі місяці які мають непарну кількість днів.
//        ● Вивести на екран чи введений з консолі місяць має парну кількість днів.




// НЕ РОЗУМІЮ ЯК ПРАВИЛЬНО ЗАПИСАТИ ЦИКЛИ ДЛЯ НАСТУПНИХ ЗНАЧЕНЬ :( !!!
public class Main {
    public static void main(String[] args) {

        String month = askUser();
        checkMonth(month);
      }
    public static String askUser(){

       Scanner scanner = new Scanner(System.in);
        System.out.println("Enter month: ");
        return scanner.next().toUpperCase();
   }
    public static void checkMonth(String month){

        for (Month m : Month.values())
           if (m.name().equals(month)){
                 System.out.println("This month is : "+month);

           }
    }
}
